# Девка
dvk = ['а', 'аа']
devka = ['aaa', 'aaaa', 'aaaaa', 'aaaaaa', 'aaaaaaa', 'aaaaaaaa', 'aaaaaaaaa', 'aaaaaaaaaa', 'aaaaaaaaaaa', 'aaaaaaaaaaaa',
         'ааа', 'аааа', 'ааааа', 'аааааа', 'ааааааа', 'аааааааа', 'ааааааааа', 'аааааааааа', 'ааааааааааа', 'аааааааааааа']
# ВРАЧА
vracha = ['врача', 'врачаа', 'врачааа', 'врачаааа', 'врачааааа', 'врачаааааа', 'врачааааааа', 'врачаааааааа',
          'враача', 'враачаа', 'враачааа', 'враачаааа', 'враачааааа', 'враачаааааа', 'враачааааааа', 'враачаааааааа',
          'врааача', 'врааачаа', 'врааачааа', 'врааачаааа', 'врааачааааа', 'врааачаааааа', 'врааачааааааа', 'врааачаааааааа',
          'враааача', 'враааачаа', 'враааачааа', 'враааачаааа', 'враааачааааа', 'враааачаааааа', 'враааачааааааа', 'враааачаааааааа',
          'врааааача', 'врааааачаа', 'врааааачааа', 'врааааачаааа', 'врааааачааааа', 'врааааачаааааа', 'врааааачааааааа', 'врааааачаааааааа',
          'враааааача', 'враааааачаа', 'враааааачааа', 'врааааачаааа', 'враааааачааааа', 'враааааачаааааа', 'враааааачааааааа', 'враааааачаааааааа']

# Барсук
suk = ['сук']
syuk = ['сюк']

# IPv6
ip_block = ['/29']

# Гит
git1 = ' гит'
git2 = 'гит'

# Для опроса
enter_question = '✅ Введи тему опроса'
who_will = {}
who_will[0] = ['Апол',  # 0
               'Канат',  # 1
               'Лёха',  # 2
               'Нтщ',  # 3
               'Толян',  # 4
               'Виктор',  # 5
               'Кирилл',  # 6
               'Эля',  # 7
               'Тарс',  # 8
               'Пауза',  # 9
               'Макс Е.',  # 10
               'Макс И.',  # 11
               'Катя',  # 12
               'Окс',  # 13
               'Ксю',  # 14
               'Роман',  # 15
               'Марго',  # 16
               'Мишаня']  # 17

who_will[1] = ['❌ Апол',  # 0
               '❌ Канат',  # 1
               '❌ Лёха',  # 2
               '❌ Нтщ',  # 3
               '❌ Толян',  # 4
               '❌ Виктор',  # 5
               '❌ Кирилл',  # 6
               '❌ Эля',  # 7
               '❌ Тарс',  # 8
               '❌ Пауза',  # 9
               '❌ Макс Е.',  # 10
               '❌ Макс И.',  # 11
               '❌ Катя',  # 12
               '❌ Окс',  # 13
               '❌ Ксю',  # 14
               '❌ Роман',  # 15
               '❌ Марго',  # 16
               '❌ Мишаня']  # 17

who_will[2] = ['\u2705 Апол',  # 0
               '\u2705 Канат',  # 1
               '\u2705 Лёха',  # 2
               '\u2705 Нтщ',  # 3
               '\u2705 Толян',  # 4
               '\u2705 Виктор',  # 5
               '\u2705 Кирилл',  # 6
               '\u2705 Эля',  # 7
               '\u2705 Тарс',  # 8
               '\u2705 Пауза',  # 9
               '\u2705 Макс Е.',  # 10
               '\u2705 Макс И.',  # 11
               '\u2705 Катя',  # 12
               '\u2705 Окс',  # 13
               '\u2705 Ксю',  # 14
               '\u2705 Роман',  # 15
               '\u2705 Марго',  # 16
               '\u2705 Мишаня']  # 17

who_will[3] = ['🤷🏼‍♂️ Апол',  # 0
               '🤷🏻‍♂️ Канат',  # 1
               '🤷🏻‍♂️ Лёха',  # 2
               '🤷🏼‍♀️ Нтщ',  # 3
               '🤷🏻‍♂️ Толян',  # 4
               '🤷🏼‍♂️ Виктор',  # 5
               '🤷🏻‍♂️ Кирилл',  # 6
               '🤷🏼‍♀️ Эля',  # 7
               '🤷🏼‍♂️ Тарс',  # 8
               '🤷🏻‍♀️ Пауза',  # 9
               '🤷🏻‍♂️ Макс Е.',  # 10
               '🤷🏻‍♂️ Макс И.',  # 11
               '🤷🏼‍♀️ Катя',  # 12
               '🤷🏻‍♀️ Окс',  # 13
               '🤷🏻‍♀️ Ксю',  # 14
               '🤷🏼‍♂️ Роман',  # 15
               '🤷🏻‍♀️ Марго',  # 16
               '🤷🏻‍♂️ Мишаня']  # 17

who_will_ids = [740100,  # 0
                235208407,  # 1
                51994109,  # 2
                213701955,  # 3
                154495805,  # 4
                155680674,  # 5
                873863,  # 6
                385002370,  # 7
                113093545,  # 8
                165746780,  # 9
                212589749,  # 10
                2539125,  # 11
                434756061,  # 12
                358303246,  # 13
                211717649,  # 14
                228721090,  # 15
                135125333,  # 16
                185997507]  # 17

# Ошибки
errors = ['Попытка команды /set',  # 0
          'Попытка команды /send',  # 1
          'Обращение из чужого чата',  # 2
          'Ошибка при получении статуса сервера',  # 3
          'Ошибка при отправке фото из ВКонтакте',  # 4
          'Ошибка при отправке подарка из ВКонтакте',  # 5
          'Ошибка при отправке стикера из ВКонтакте',  # 6
          'Ошибка при отправке товара из ВКонтакте',  # 7
          'Ошибка при получении имени пользователя ВК',  # 8
          'Ошибка при отправке сообщения в чат Telegram',  # 9
          'Ошибка при получении сообщений в send_vk_dialogs_messages()',  # 10
          'Ошибка при получении списка диалогов в send_vk_dialogs_messages()',  # 11
          'Token ВКонтакте не установлен',  # 12
          'Ошибка при отправке в Шоблу',  # 13
          'Ошибка при создании опроса',  # 14
          'Введено некорректное название фильма',  # 15
          'Ошибка при поиске введеного фильма',  # 16
          'Ошибка при вводе фильма для опроса',  # 17
          'Ошибка при перезапуске Movies bot',  # 18
          'Ошибка при перезапуске Fuel bot',  # 19
          'Ошибка при перезапуске Books bot',  # 20
          'Ошибка при получении статуса сервера',  # 21
          'Ошибка при поиске скринов',  # 22
          'Ошибка при попытке отправки сообщения в Шоблу',  # 23
          'Ошибка при попытке обновления опроса /who',  # 24
          'Ошибка при попытке обновления опроса /kinch',  # 25
          'Ошибка при получении информации о фильме с TMDB',  # 26
          'Ошибка при отправки /kinch опроса в Шоблу',  # 27
          'Ошибка при отправки /kinch опроса в Шоблу без TMDB',  # 28
          'Ошибка при запросе прокси',  # 29
          'Ошибка при создании бекапа']  # 30

# ID участниеов Шобла - ReBorn в Telegram
tg_ids = [0,
          740100,  # Я
          155680674,  # Виктор
          873863,  # Кирилл
          212589749,  # Макс Ефимов
          211717649,  # Ксю
          165746780,  # ||
          185997507,  # Мишаня
          51994109,  # Леха Носов
          228721090,  # Ромик
          154495805,  # ТоЛRн
          2539125,  # Макс Иванов
          217093214,  # Женя
          113093545,  # Тарас
          235208407,  # Игнатов
          385002370,  # Эля
          213701955,  # Нтщ
          434756061,  # Катя
          358303246,  # Окс
          135125333,  # Марго
          185457859]  # Darya Sid

tg_names = ['Никто',
            'Апол',
            'Витя',
            'Кирюха',
            'Максон',
            'Ксю',
            'Пауза',
            'Мишаня',
            'Лёха',
            'Роман',
            'Толян',
            'Максончик',
            'Жека',
            'Тарс',
            'Канатик',
            'Эля',
            'Нтщ',
            'Катя',
            'Окс',
            'Марго',
            'Darya']

tg_drs = ['0.0',
          '2.2',  # Я
          '29.3',  # Виктор
          '7.4',  # Кирилл
          '13.2',  # Макс Ефимов
          '30.4',  # Ксю
          '28.3',  # ||
          '1.9',  # Мишаня
          '29.7',  # Леха Носов
          '5.1',  # Ромик
          '3.12',  # ТоЛRн
          '28.3',  # Макс Иванов
          '0.0',  # Женя
          '2.11',  # Тарас
          '26.7',  # Игнатов
          '26.7',  # Эля
          '9.5',  # Нтщ
          '21.12',  # Катя
          '23.2',  # Окс
          '13.7',  # Марго
          '0.0']  # Darya Sid

# ID ВКонтакте в Шобле
ids = [89920677,  # Я
       16803892,  # Виктор
       3275179,  # Кирилл
       12941864,  # Макс Ефимов
       15204977,  # Ксю
       18447003,  # ||
       31483163,  # Мишаня
       32985079,  # Леха Носов
       31360136,  # Ромик
       259767250,  # ТоЛRн
       31996805,  # Макс Иванов
       123314757,  # Натаще
       320643669,  # Женя
       1288680,  # Тарас
       13722861,  # Игнатов
       376406377,  # Darya Sid
       23606961,  # Эля
       10112744,  # Оксана
       385306304]  # Telegram Chat

vk_names = ['Андрей Анашкин',
            'Виктор Фрелих',
            'Кирилл Жуйков',
            'Макс Ефимов',
            'Ксения Бурдастых',
            'Da Vinci',
            'Михаил Балдин',
            'Лёха Носов',
            'Рома Казицкий',
            'Анатолий Козлов',
            'Максим Иванов',
            'Наталия Никитченко',
            'Евгения Романова',
            'Тарас Нагорный',
            'Илья Игнатов',
            'Darya Sid',
            'Элечка Азнакаева',
            'Таточка Узурпатор',
            'Telegram Chat']

#  Ссылка для аторизации
auth_link = 'https://oauth.vk.com/authorize?client_id=5514176&display=page&scope=photos,messages,docs,friends,offline&response_type=token'
close_access = '⛔️ *Закрыть доступ:*\nhttps://vk.com/settings?act=apps\n\n@BotFather /revoke'

# Тексты при start и help
chat_name = 'Шобла - ReBorn'
help_text_light = '‼️ Вы не участник чата *{0}* 💬'.format(chat_name)
help_text = '🤖 *Shobla Bot* используется для:\n\n' \
            '1) 🚀 настраивать прокси, чтобы обходить блокировки РКН - /fuckrkn\n' \
            '2) ✅ создания опросов - /who\n' \
            '3) 🎬 приглашения запалить кинцо - /kinch\n' \
            '4) 🛍 вызова скидок - /discount\n' \
            '5) 🎧 перехода в собственный плейлист - /music\n' \
            '6) 💁‍♀️🚗 Встроенная девка за рулём\n' \
            '7) 👩🏻‍⚕️ Встроенный вызов врачаааа'.format(chat_name)

# '1) 💬 отправки любых сообщений и вложений из ВКонтакте в чат {0}. ' \
# 'Просто отправь сообщение этому профилю vk.com/shoblabot\n'


help_text_apple = '👑  ⛔️Закрыть доступ\n/s    /close\n🆔 Получить id чата Telegram:\n/set\n' \
                  '💬 Отправить от лица бота:\n/send &-1001126587083 &сообщение\n' \
                  '🌐 Ссылка приложения:\n{0}'.format(auth_link)

# Поиск фильма
send_movie = '🎬 Напиши название фильма'
tmdb_search = '🔎 Выполняется поиск фильмов, подождите'
tmdb_choose = '📌 Результаты поиска по фильму '
no_film = '🙅‍♂️ Ни один из предложенных'
no_tmdb = '🤷‍♂ ️Ничего не найдено по вашему запросу. Создать опрос по фильму '
no_tmdb_yes_no = '❓ Создать опрос по фильму '
canceled = '❌ Ввод отменен'
da_net = ['Да', 'Нет']
info_link = ['Ссылка фильма на TMDB', 'Ссылка фильма на IMDB', 'Найти фильм в Google']
info_fields = ['Жанр',  # 0
               'Рейтинг КП',  # 1
               'Рейтинг IMDB',  # 2
               'Премьера',  # 3
               'Режиссер',  # 4
               'Актеры',  # 5
               'Описание',  # 6
               'Посмотреть трейлер',  # 7
               'Рейтинг TMDB',  # 8
               'Длительность']  # 9
info_month = ['января', 'февраля', 'марта', 'апреля', 'мая', 'июня', 'июля', 'августа', 'сентября', 'октября',
              'ноября', 'декабря']
tmdb_errors = ['Ошибка при добавлении выбранного фильма в базу',  # 0
               'Ошибка при предложении внести фильм в базу',  # 1
               'Ошибка при внесении в базу введенного фильма',  # 2
               'Отмена сохранения введенного фильма в базу',  # 3
               'Ошибка при добавлении выбранного фильма в wishlist',  # 4
               'Ошибка при предложении внести фильм в wishlist',  # 5
               'Ошибка при внесении в wishlist введенного фильма']  # 6

# Ссылки на прокси
fuckrkn = '*Телега, живи!*\nПодключай прокси, затем *Enable/Включить* и все готово, ты разблокировал Телегу и' \
          ' нагнул РКН 😎.\n' \
          'Есть вариант: заходи к боту @socks5\\_bot.\nТам тоже все делается в пару кликов подобным образом.\n\n' \
          '*P.S.*: Если какая то прокси не будет работать и у тебя ничего в телеге не грузит, то сообщи ' \
          '[Аполу](tg://user?id=740100) об этом, будь душкой 😘.'

proxy = ['https://t.me/socks?server=bg1.proxy.veesecurity.com&port=80&user=PROXY_5AC7D3B8BC9BC&pass=ffe17eb2a2d6b37f',  #0
         'https://t.me/socks?server=nl1.proxy.veesecurity.com&port=80&user=PROXY_5AC7D4154BEEC&pass=60c48577a0857d10',  # 1
         'https://t.me/socks?server=nl1.proxy.veesecurity.com&port=80&user=PROXY_5AC7D40002198&pass=dd8b152a03709b12',  # 2
         'https://t.me/socks?server=nl1.proxy.veesecurity.com&port=80&user=PROXY_5AC7D407AF932&pass=71c3bee6c4517694',  # 3
         'https://t.me/socks?server=bg1.proxy.veesecurity.com&port=80&user=PROXY_5AC7DAD78487F&pass=b1f28891a18a8160',  # 4
         'https://t.me/socks?server=nl2.proxy.veesecurity.com&port=80&user=PROXY_5AC7DAE3B1B39&pass=0fdcffba8bbc1a1c',  # 5
         'https://t.me/socks?server=bg1.proxy.veesecurity.com&port=80&user=PROXY_5AC7DB0736BE9&pass=cedd4bb35e223b30',  # 6
         'https://t.me/socks?server=nl2.proxy.veesecurity.com&port=80&user=PROXY_5AC7DB212D90C&pass=0e42d451211a5764',  # 7
         'https://t.me/socks?server=bg1.proxy.veesecurity.com&port=80&user=PROXY_5AC7DB2978F15&pass=f5161b129a8ab732',  # 8
         'https://t.me/socks?server=nl2.proxy.veesecurity.com&port=80&user=PROXY_5AC7DB317FC11&pass=19d0c06f04b692d6',  # 9
         'https://t.me/socks?server=bg1.proxy.veesecurity.com&port=80&user=PROXY_5AC7DB3ABA0DE&pass=aa8d4eeeea86b8b4',  # 10
         'https://t.me/socks?server=nl2.proxy.veesecurity.com&port=80&user=PROXY_5AC7DB4741F82&pass=499ed6696e186378',  # 11
         'https://t.me/socks?server=nl1.proxy.veesecurity.com&port=80&user=PROXY_5AC7DB583525F&pass=9b29b515fde5c18a',  # 12
         'https://t.me/socks?server=nl2.proxy.veesecurity.com&port=80&user=PROXY_5AC7DB64A8136&pass=b08bbf9fe8ab7d2b',  # 13
         'https://t.me/socks?server=bg1.proxy.veesecurity.com&port=80&user=PROXY_5AC7DB6E9846A&pass=b7a434d42f192bc4',  # 14
         'https://t.me/socks?server=nl2.proxy.veesecurity.com&port=80&user=PROXY_5AC7DB7AE066D&pass=467c4aab12e436fe',  # 15
         'https://t.me/socks?server=nl2.proxy.veesecurity.com&port=80&user=PROXY_5AC7DB8A865F9&pass=0a2a607a46ad6a8b',  # 16
         'https://t.me/socks?server=nl2.proxy.veesecurity.com&port=80&user=PROXY_5AC7DB92094E2&pass=e7639ea165ae942b',  # 17
         'https://t.me/socks?server=nl1.proxy.veesecurity.com&port=80&user=PROXY_5AC7DB9A1449F&pass=a82f2c99c63a534f',  # 18
         'https://t.me/socks?server=nl1.proxy.veesecurity.com&port=80&user=PROXY_5AC7DBA27EE14&pass=8403a9bf80e3539d',  # 19
         'https://t.me/socks?server=nl1.proxy.veesecurity.com&port=80&user=PROXY_5AC7DBAD7F8DB&pass=e0c37962dd3b060a',  # 20
         'https://t.me/socks?server=nl1.proxy.veesecurity.com&port=80&user=PROXY_5AC7DBCE29453&pass=961397ac2009956d',  # 21
         'https://t.me/socks?server=nl1.proxy.veesecurity.com&port=80&user=PROXY_5AC7DBD460018&pass=fecec0b4987abb5d',  # 22
         'https://t.me/socks?server=bg1.proxy.veesecurity.com&port=80&user=PROXY_5AC7DBDC63109&pass=e038774baf1ce029',  # 23
         'https://t.me/socks?server=nl1.proxy.veesecurity.com&port=80&user=PROXY_5AC7DBE534C99&pass=cba573feafb30913',  # 24
         'https://t.me/socks?server=par3.proxy.veesecurity.com&port=443&user=PROXY_5AD4F5F904A71&pass=868c70f062bd26d0',  # 25
         'https://t.me/socks?server=par3.proxy.veesecurity.com&port=443&user=PROXY_5AD4F60379ABD&pass=010d864358bda0ea',  # 26
         'https://t.me/socks?server=par3.proxy.veesecurity.com&port=443&user=PROXY_5AD4F61038904&pass=b2dfec995ed95e9d',  # 27
         'https://t.me/socks?server=par3.proxy.veesecurity.com&port=443&user=PROXY_5AD4F61782A51&pass=80637b9eead1438b',  # 28
         'https://t.me/socks?server=par3.proxy.veesecurity.com&port=443&user=PROXY_5AD4F621D8911&pass=ab653b5ac0017df8',  # 29
         'https://t.me/socks?server=par1.proxy.veesecurity.com&port=443&user=PROXY_5AD4A59926E13&pass=33bdf1bb5def1757',  # 30
         'https://t.me/socks?server=telegram.vpn99.net&port=55655',  # 31
         'https://t.me/socks?server=ssocks.cf&port=1080',  # 32
         'https://t.me/socks?server=91.121.84.121&port=3306&user=swcbbabh&pass=aYEbh6q5gQ',  # 33
         'https://t.me/socks?server=185.36.188.185&port=3306&user=swcbbabh&pass=aYEbh6q5gQ',  # 34
         'https://t.me/socks?server=95.216.19.250&port=433&user=proxyuser&pass=rjBrtr8AMZJ%24J9',  # 35
         'https://t.me/socks?server=nl3.proxy.veesecurity.com&port=80&user=PROXY_5ACB81CDDADDD&pass=b4139d63916ed8ac',  # 36
         'https://t.me/socks?server=tg.airpush.com&port=1883',  # 37
         'https://t.me/socks?server=proxy.unlockgram.it&port=5061',  # 38
         'https://t.me/socks?server=88.198.24.108&port=1080',  # 39
         'https://t.me/socks?server=188.226.141.127&port=1080',  # 40
         'https://t.me/socks?server=37.187.30.16&port=3128',  # 41
         'https://t.me/socks?server=207.154.231.217&port=1080',  # 42
         'https://t.me/socks?server=159.89.12.70&port=1080&user=telegram&pass=fuckrknfuck',  # 43
         'https://t.me/socks?server=socks5.svoi-an.us&port=1080&user=privet&pass=roskomnadzor',  # 44
         'https://t.me/proxy?server=mash.drproxy.pro&port=443&secret=dda5a7b5711e648c7bd534e4e87de2241b',  # 45
         'https://t.me/proxy?server=russia.proxy.digitalresistance.dog&port=443&secret=d41d8cd98f00b204e9800998ecf8427e']  # 46


